---
kind: property
id: P:Autodesk.Revit.DB.MEPSize.OuterDiameter
source: html/d73fd680-f2b8-7970-b4ed-74804f011475.htm
---
# Autodesk.Revit.DB.MEPSize.OuterDiameter Property

Outer diameter

## Syntax (C#)
```csharp
public double OuterDiameter { get; }
```